RTEMS/rtems/c/src/lib/libbsp/arm/atsam/libraries/libchip/include/same70/pio/pio_same70q21.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2015, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAME70Q21_PIO_
#define _SAME70Q21_PIO_

#define PIO_PA0                   (1u << 0)  /**< \brief Pin Controlled by PA0 */
#define PIO_PA1                   (1u << 1)  /**< \brief Pin Controlled by PA1 */
#define PIO_PA2                   (1u << 2)  /**< \brief Pin Controlled by PA2 */
#define PIO_PA3                   (1u << 3)  /**< \brief Pin Controlled by PA3 */
#define PIO_PA4                   (1u << 4)  /**< \brief Pin Controlled by PA4 */
#define PIO_PA5                   (1u << 5)  /**< \brief Pin Controlled by PA5 */
#define PIO_PA6                   (1u << 6)  /**< \brief Pin Controlled by PA6 */
#define PIO_PA7                   (1u << 7)  /**< \brief Pin Controlled by PA7 */
#define PIO_PA8                   (1u << 8)  /**< \brief Pin Controlled by PA8 */
#define PIO_PA9                   (1u << 9)  /**< \brief Pin Controlled by PA9 */
#define PIO_PA10                  (1u << 10) /**< \brief Pin Controlled by PA10 */
#define PIO_PA11                  (1u << 11) /**< \brief Pin Controlled by PA11 */
#define PIO_PA12                  (1u << 12) /**< \brief Pin Controlled by PA12 */
#define PIO_PA13                  (1u << 13) /**< \brief Pin Controlled by PA13 */
#define PIO_PA14                  (1u << 14) /**< \brief Pin Controlled by PA14 */
#define PIO_PA15                  (1u << 15) /**< \brief Pin Controlled by PA15 */
#define PIO_PA16                  (1u << 16) /**< \brief Pin Controlled by PA16 */
#define PIO_PA17                  (1u << 17) /**< \brief Pin Controlled by PA17 */
#define PIO_PA18                  (1u << 18) /**< \brief Pin Controlled by PA18 */
#define PIO_PA19                  (1u << 19) /**< \brief Pin Controlled by PA19 */
#define PIO_PA20                  (1u << 20) /**< \brief Pin Controlled by PA20 */
#define PIO_PA21                  (1u << 21) /**< \brief Pin Controlled by PA21 */
#define PIO_PA22                  (1u << 22) /**< \brief Pin Controlled by PA22 */
#define PIO_PA23                  (1u << 23) /**< \brief Pin Controlled by PA23 */
#define PIO_PA24                  (1u << 24) /**< \brief Pin Controlled by PA24 */
#define PIO_PA25                  (1u << 25) /**< \brief Pin Controlled by PA25 */
#define PIO_PA26                  (1u << 26) /**< \brief Pin Controlled by PA26 */
#define PIO_PA27                  (1u << 27) /**< \brief Pin Controlled by PA27 */
#define PIO_PA28                  (1u << 28) /**< \brief Pin Controlled by PA28 */
#define PIO_PA29                  (1u << 29) /**< \brief Pin Controlled by PA29 */
#define PIO_PA30                  (1u << 30) /**< \brief Pin Controlled by PA30 */
#define PIO_PA31                  (1u << 31) /**< \brief Pin Controlled by PA31 */
#define PIO_PB0                   (1u << 0)  /**< \brief Pin Controlled by PB0 */
#define PIO_PB1                   (1u << 1)  /**< \brief Pin Controlled by PB1 */
#define PIO_PB2                   (1u << 2)  /**< \brief Pin Controlled by PB2 */
#define PIO_PB3                   (1u << 3)  /**< \brief Pin Controlled by PB3 */
#define PIO_PB4                   (1u << 4)  /**< \brief Pin Controlled by PB4 */
#define PIO_PB5                   (1u << 5)  /**< \brief Pin Controlled by PB5 */
#define PIO_PB6                   (1u << 6)  /**< \brief Pin Controlled by PB6 */
#define PIO_PB7                   (1u << 7)  /**< \brief Pin Controlled by PB7 */
#define PIO_PB8                   (1u << 8)  /**< \brief Pin Controlled by PB8 */
#define PIO_PB9                   (1u << 9)  /**< \brief Pin Controlled by PB9 */
#define PIO_PB12                  (1u << 12) /**< \brief Pin Controlled by PB12 */
#define PIO_PB13                  (1u << 13) /**< \brief Pin Controlled by PB13 */
#define PIO_PC0                   (1u << 0)  /**< \brief Pin Controlled by PC0 */
#define PIO_PC1                   (1u << 1)  /**< \brief Pin Controlled by PC1 */
#define PIO_PC2                   (1u << 2)  /**< \brief Pin Controlled by PC2 */
#define PIO_PC3                   (1u << 3)  /**< \brief Pin Controlled by PC3 */
#define PIO_PC4                   (1u << 4)  /**< \brief Pin Controlled by PC4 */
#define PIO_PC5                   (1u << 5)  /**< \brief Pin Controlled by PC5 */
#define PIO_PC6                   (1u << 6)  /**< \brief Pin Controlled by PC6 */
#define PIO_PC7                   (1u << 7)  /**< \brief Pin Controlled by PC7 */
#define PIO_PC8                   (1u << 8)  /**< \brief Pin Controlled by PC8 */
#define PIO_PC9                   (1u << 9)  /**< \brief Pin Controlled by PC9 */
#define PIO_PC10                  (1u << 10) /**< \brief Pin Controlled by PC10 */
#define PIO_PC11                  (1u << 11) /**< \brief Pin Controlled by PC11 */
#define PIO_PC12                  (1u << 12) /**< \brief Pin Controlled by PC12 */
#define PIO_PC13                  (1u << 13) /**< \brief Pin Controlled by PC13 */
#define PIO_PC14                  (1u << 14) /**< \brief Pin Controlled by PC14 */
#define PIO_PC15                  (1u << 15) /**< \brief Pin Controlled by PC15 */
#define PIO_PC16                  (1u << 16) /**< \brief Pin Controlled by PC16 */
#define PIO_PC17                  (1u << 17) /**< \brief Pin Controlled by PC17 */
#define PIO_PC18                  (1u << 18) /**< \brief Pin Controlled by PC18 */
#define PIO_PC19                  (1u << 19) /**< \brief Pin Controlled by PC19 */
#define PIO_PC20                  (1u << 20) /**< \brief Pin Controlled by PC20 */
#define PIO_PC21                  (1u << 21) /**< \brief Pin Controlled by PC21 */
#define PIO_PC22                  (1u << 22) /**< \brief Pin Controlled by PC22 */
#define PIO_PC23                  (1u << 23) /**< \brief Pin Controlled by PC23 */
#define PIO_PC24                  (1u << 24) /**< \brief Pin Controlled by PC24 */
#define PIO_PC25                  (1u << 25) /**< \brief Pin Controlled by PC25 */
#define PIO_PC26                  (1u << 26) /**< \brief Pin Controlled by PC26 */
#define PIO_PC27                  (1u << 27) /**< \brief Pin Controlled by PC27 */
#define PIO_PC28                  (1u << 28) /**< \brief Pin Controlled by PC28 */
#define PIO_PC29                  (1u << 29) /**< \brief Pin Controlled by PC29 */
#define PIO_PC30                  (1u << 30) /**< \brief Pin Controlled by PC30 */
#define PIO_PC31                  (1u << 31) /**< \brief Pin Controlled by PC31 */
#define PIO_PD0                   (1u << 0)  /**< \brief Pin Controlled by PD0 */
#define PIO_PD1                   (1u << 1)  /**< \brief Pin Controlled by PD1 */
#define PIO_PD2                   (1u << 2)  /**< \brief Pin Controlled by PD2 */
#define PIO_PD3                   (1u << 3)  /**< \brief Pin Controlled by PD3 */
#define PIO_PD4                   (1u << 4)  /**< \brief Pin Controlled by PD4 */
#define PIO_PD5                   (1u << 5)  /**< \brief Pin Controlled by PD5 */
#define PIO_PD6                   (1u << 6)  /**< \brief Pin Controlled by PD6 */
#define PIO_PD7                   (1u << 7)  /**< \brief Pin Controlled by PD7 */
#define PIO_PD8                   (1u << 8)  /**< \brief Pin Controlled by PD8 */
#define PIO_PD9                   (1u << 9)  /**< \brief Pin Controlled by PD9 */
#define PIO_PD10                  (1u << 10) /**< \brief Pin Controlled by PD10 */
#define PIO_PD11                  (1u << 11) /**< \brief Pin Controlled by PD11 */
#define PIO_PD12                  (1u << 12) /**< \brief Pin Controlled by PD12 */
#define PIO_PD13                  (1u << 13) /**< \brief Pin Controlled by PD13 */
#define PIO_PD14                  (1u << 14) /**< \brief Pin Controlled by PD14 */
#define PIO_PD15                  (1u << 15) /**< \brief Pin Controlled by PD15 */
#define PIO_PD16                  (1u << 16) /**< \brief Pin Controlled by PD16 */
#define PIO_PD17                  (1u << 17) /**< \brief Pin Controlled by PD17 */
#define PIO_PD18                  (1u << 18) /**< \brief Pin Controlled by PD18 */
#define PIO_PD19                  (1u << 19) /**< \brief Pin Controlled by PD19 */
#define PIO_PD20                  (1u << 20) /**< \brief Pin Controlled by PD20 */
#define PIO_PD21                  (1u << 21) /**< \brief Pin Controlled by PD21 */
#define PIO_PD22                  (1u << 22) /**< \brief Pin Controlled by PD22 */
#define PIO_PD23                  (1u << 23) /**< \brief Pin Controlled by PD23 */
#define PIO_PD24                  (1u << 24) /**< \brief Pin Controlled by PD24 */
#define PIO_PD25                  (1u << 25) /**< \brief Pin Controlled by PD25 */
#define PIO_PD26                  (1u << 26) /**< \brief Pin Controlled by PD26 */
#define PIO_PD27                  (1u << 27) /**< \brief Pin Controlled by PD27 */
#define PIO_PD28                  (1u << 28) /**< \brief Pin Controlled by PD28 */
#define PIO_PD29                  (1u << 29) /**< \brief Pin Controlled by PD29 */
#define PIO_PD30                  (1u << 30) /**< \brief Pin Controlled by PD30 */
#define PIO_PD31                  (1u << 31) /**< \brief Pin Controlled by PD31 */
#define PIO_PE0                   (1u << 0)  /**< \brief Pin Controlled by PE0 */
#define PIO_PE1                   (1u << 1)  /**< \brief Pin Controlled by PE1 */
#define PIO_PE2                   (1u << 2)  /**< \brief Pin Controlled by PE2 */
#define PIO_PE3                   (1u << 3)  /**< \brief Pin Controlled by PE3 */
#define PIO_PE4                   (1u << 4)  /**< \brief Pin Controlled by PE4 */
#define PIO_PE5                   (1u << 5)  /**< \brief Pin Controlled by PE5 */
/* ========== Pio definition for AFEC0 peripheral ========== */
#define PIO_PD30X1_AFE0_AD0       (1u << 30) /**< \brief Afec0 signal: AFE0_AD0 */
#define PIO_PA21X1_AFE0_AD1       (1u << 21) /**< \brief Afec0 signal: AFE0_AD1/PIODCEN2 */
#define PIO_PA21X1_PIODCEN2       (1u << 21) /**< \brief Afec0 signal: AFE0_AD1/PIODCEN2 */
#define PIO_PB0X1_AFE0_AD10       (1u << 0)  /**< \brief Afec0 signal: AFE0_AD10/RTCOUT0 */
#define PIO_PB0X1_RTCOUT0         (1u << 0)  /**< \brief Afec0 signal: AFE0_AD10/RTCOUT0 */
#define PIO_PB3X1_AFE0_AD2        (1u << 3)  /**< \brief Afec0 signal: AFE0_AD2/WKUP12 */
#define PIO_PB3X1_WKUP12          (1u << 3)  /**< \brief Afec0 signal: AFE0_AD2/WKUP12 */
#define PIO_PE5X1_AFE0_AD3        (1u << 5)  /**< \brief Afec0 signal: AFE0_AD3 */
#define PIO_PE4X1_AFE0_AD4        (1u << 4)  /**< \brief Afec0 signal: AFE0_AD4 */
#define PIO_PB2X1_AFE0_AD5        (1u << 2)  /**< \brief Afec0 signal: AFE0_AD5 */
#define PIO_PA17X1_AFE0_AD6       (1u << 17) /**< \brief Afec0 signal: AFE0_AD6 */
#define PIO_PA18X1_AFE0_AD7       (1u << 18) /**< \brief Afec0 signal: AFE0_AD7 */
#define PIO_PA19X1_AFE0_AD8       (1u << 19) /**< \brief Afec0 signal: AFE0_AD8/WKUP9 */
#define PIO_PA19X1_WKUP9          (1u << 19) /**< \brief Afec0 signal: AFE0_AD8/WKUP9 */
#define PIO_PA20X1_AFE0_AD9       (1u << 20) /**< \brief Afec0 signal: AFE0_AD9/WKUP10 */
#define PIO_PA20X1_WKUP10         (1u << 20) /**< \brief Afec0 signal: AFE0_AD9/WKUP10 */
#define PIO_PA8B_AFE0_ADTRG       (1u << 8)  /**< \brief Afec0 signal: AFE0_ADTRG */
/* ========== Pio definition for AFEC1 peripheral ========== */
#define PIO_PB1X1_AFE1_AD0        (1u << 1)  /**< \brief Afec1 signal: AFE1_AD0/RTCOUT1 */
#define PIO_PB1X1_RTCOUT1         (1u << 1)  /**< \brief Afec1 signal: AFE1_AD0/RTCOUT1 */
#define PIO_PC13X1_AFE1_AD1       (1u << 13) /**< \brief Afec1 signal: AFE1_AD1 */
#define PIO_PE3X1_AFE1_AD10       (1u << 3)  /**< \brief Afec1 signal: AFE1_AD10 */
#define PIO_PE0X1_AFE1_AD11       (1u << 0)  /**< \brief Afec1 signal: AFE1_AD11 */
#define PIO_PC15X1_AFE1_AD2       (1u << 15) /**< \brief Afec1 signal: AFE1_AD2 */
#define PIO_PC12X1_AFE1_AD3       (1u << 12) /**< \brief Afec1 signal: AFE1_AD3 */
#define PIO_PC29X1_AFE1_AD4       (1u << 29) /**< \brief Afec1 signal: AFE1_AD4 */
#define PIO_PC30X1_AFE1_AD5       (1u << 30) /**< \brief Afec1 signal: AFE1_AD5 */
#define PIO_PC31X1_AFE1_AD6       (1u << 31) /**< \brief Afec1 signal: AFE1_AD6 */
#define PIO_PC26X1_AFE1_AD7       (1u << 26) /**< \brief Afec1 signal: AFE1_AD7 */
#define PIO_PC27X1_AFE1_AD8       (1u << 27) /**< \brief Afec1 signal: AFE1_AD8 */
#define PIO_PC0X1_AFE1_AD9        (1u << 0)  /**< \brief Afec1 signal: AFE1_AD9 */
#define PIO_PD9C_AFE1_ADTRG       (1u << 9)  /**< \brief Afec1 signal: AFE1_ADTRG */
/* ========== Pio definition for ARM peripheral ========== */
#define PIO_PB7X1_SWCLK           (1u << 7)  /**< \brief Arm signal: SWCLK/TCK */
#define PIO_PB7X1_TCK             (1u << 7)  /**< \brief Arm signal: SWCLK/TCK */
#define PIO_PB6X1_SWDIO           (1u << 6)  /**< \brief Arm signal: SWDIO/TMS */
#define PIO_PB6X1_TMS             (1u << 6)  /**< \brief Arm signal: SWDIO/TMS */
#define PIO_PB4X1_TDI             (1u << 4)  /**< \brief Arm signal: TDI */
#define PIO_PB5X1_TDO             (1u << 5)  /**< \brief Arm signal: TDO/TRACESWO/WKUP13 */
#define PIO_PB5X1_TRACESWO        (1u << 5)  /**< \brief Arm signal: TDO/TRACESWO/WKUP13 */
#define PIO_PB5X1_WKUP13          (1u << 5)  /**< \brief Arm signal: TDO/TRACESWO/WKUP13 */
/* ========== Pio definition for DACC peripheral ========== */
#define PIO_PB13X1_DAC0           (1u << 13) /**< \brief Dacc signal: DAC0 */
#define PIO_PD0X1_DAC1            (1u << 0)  /**< \brief Dacc signal: DAC1 */
#define PIO_PA2C_DATRG            (1u << 2)  /**< \brief Dacc signal: DATRG */
/* ========== Pio definition for EBI peripheral ========== */
#define PIO_PC18A_A0              (1u << 18) /**< \brief Ebi signal: A0/NBS0 */
#define PIO_PC18A_NBS0            (1u << 18) /**< \brief Ebi signal: A0/NBS0 */
#define PIO_PC19A_A1              (1u << 19) /**< \brief Ebi signal: A1 */
#define PIO_PC28A_A10             (1u << 28) /**< \brief Ebi signal: A10 */
#define PIO_PC29A_A11             (1u << 29) /**< \brief Ebi signal: A11 */
#define PIO_PC30A_A12             (1u << 30) /**< \brief Ebi signal: A12 */
#define PIO_PC31A_A13             (1u << 31) /**< \brief Ebi signal: A13 */
#define PIO_PA18C_A14             (1u << 18) /**< \brief Ebi signal: A14 */
#define PIO_PA19C_A15             (1u << 19) /**< \brief Ebi signal: A15 */
#define PIO_PA20C_A16             (1u << 20) /**< \brief Ebi signal: A16/BA0 */
#define PIO_PA20C_BA0             (1u << 20) /**< \brief Ebi signal: A16/BA0 */
#define PIO_PA0C_A17              (1u << 0)  /**< \brief Ebi signal: A17/BA1 */
#define PIO_PA0C_BA1              (1u << 0)  /**< \brief Ebi signal: A17/BA1 */
#define PIO_PA1C_A18              (1u << 1)  /**< \brief Ebi signal: A18 */
#define PIO_PA23C_A19             (1u << 23) /**< \brief Ebi signal: A19 */
#define PIO_PC20A_A2              (1u << 20) /**< \brief Ebi signal: A2 */
#define PIO_PA24C_A20             (1u << 24) /**< \brief Ebi signal: A20 */
#define PIO_PC16A_A21             (1u << 16) /**< \brief Ebi signal: A21/NANDALE */
#define PIO_PC16A_NANDALE         (1u << 16) /**< \brief Ebi signal: A21/NANDALE */
#define PIO_PC17A_A22             (1u << 17) /**< \brief Ebi signal: A22/NANDCLE */
#define PIO_PC17A_NANDCLE         (1u << 17) /**< \brief Ebi signal: A22/NANDCLE */
#define PIO_PA25C_A23             (1u << 25) /**< \brief Ebi signal: A23 */
#define PIO_PC21A_A3              (1u << 21) /**< \brief Ebi signal: A3 */
#define PIO_PC22A_A4              (1u << 22) /**< \brief Ebi signal: A4 */
#define PIO_PC23A_A5              (1u << 23) /**< \brief Ebi signal: A5 */
#define PIO_PC24A_A6              (1u << 24) /**< \brief Ebi signal: A6 */
#define PIO_PC25A_A7              (1u << 25) /**< \brief Ebi signal: A7 */
#define PIO_PC26A_A8              (1u << 26) /**< \brief Ebi signal: A8 */
#define PIO_PC27A_A9              (1u << 27) /**< \brief Ebi signal: A9 */
#define PIO_PD17C_CAS             (1u << 17) /**< \brief Ebi signal: CAS */
#define PIO_PC0A_D0               (1u << 0)  /**< \brief Ebi signal: D0 */
#define PIO_PC1A_D1               (1u << 1)  /**< \brief Ebi signal: D1 */
#define PIO_PE2A_D10              (1u << 2)  /**< \brief Ebi signal: D10 */
#define PIO_PE3A_D11              (1u << 3)  /**< \brief Ebi signal: D11 */
#define PIO_PE4A_D12              (1u << 4)  /**< \brief Ebi signal: D12 */
#define PIO_PE5A_D13              (1u << 5)  /**< \brief Ebi signal: D13 */
#define PIO_PA15A_D14             (1u << 15) /**< \brief Ebi signal: D14 */
#define PIO_PA16A_D15             (1u << 16) /**< \brief Ebi signal: D15 */
#define PIO_PC2A_D2               (1u << 2)  /**< \brief Ebi signal: D2 */
#define PIO_PC3A_D3               (1u << 3)  /**< \brief Ebi signal: D3 */
#define PIO_PC4A_D4               (1u << 4)  /**< \brief Ebi signal: D4 */
#define PIO_PC5A_D5               (1u << 5)  /**< \brief Ebi signal: D5 */
#define PIO_PC6A_D6               (1u << 6)  /**< \brief Ebi signal: D6 */
#define PIO_PC7A_D7               (1u << 7)  /**< \brief Ebi signal: D7 */
#define PIO_PE0A_D8               (1u << 0)  /**< \brief Ebi signal: D8 */
#define PIO_PE1A_D9               (1u << 1)  /**< \brief Ebi signal: D9 */
#define PIO_PC9A_NANDOE           (1u << 9)  /**< \brief Ebi signal: NANDOE */
#define PIO_PC10A_NANDWE          (1u << 10) /**< \brief Ebi signal: NANDWE */
#define PIO_PC14A_NCS0            (1u << 14) /**< \brief Ebi signal: NCS0 */
#define PIO_PC15A_NCS1            (1u << 15) /**< \brief Ebi signal: NCS1/SDCS */
#define PIO_PC15A_SDCS            (1u << 15) /**< \brief Ebi signal: NCS1/SDCS */
#define PIO_PD18A_NCS1            (1u << 18) /**< \brief Ebi signal: NCS1/SDCS */
#define PIO_PD18A_SDCS            (1u << 18) /**< \brief Ebi signal: NCS1/SDCS */
#define PIO_PA22C_NCS2            (1u << 22) /**< \brief Ebi signal: NCS2 */
#define PIO_PC12A_NCS3            (1u << 12) /**< \brief Ebi signal: NCS3 */
#define PIO_PD19A_NCS3            (1u << 19) /**< \brief Ebi signal: NCS3 */
#define PIO_PC11A_NRD             (1u << 11) /**< \brief Ebi signal: NRD */
#define PIO_PC13A_NWAIT           (1u << 13) /**< \brief Ebi signal: NWAIT */
#define PIO_PC8A_NWR0             (1u << 8)  /**< \brief Ebi signal: NWR0/NWE */
#define PIO_PC8A_NWE              (1u << 8)  /**< \brief Ebi signal: NWR0/NWE */
#define PIO_PD15C_NWR1            (1u << 15) /**< \brief Ebi signal: NWR1/NBS1 */
#define PIO_PD15C_NBS1            (1u << 15) /**< \brief Ebi signal: NWR1/NBS1 */
#define PIO_PD16C_RAS             (1u << 16) /**< \brief Ebi signal: RAS */
#define PIO_PC13C_SDA10           (1u << 13) /**< \brief Ebi signal: SDA10 */
#define PIO_PD13C_SDA10           (1u << 13) /**< \brief Ebi signal: SDA10 */
#define PIO_PD23C_SDCK            (1u << 23) /**< \brief Ebi signal: SDCK */
#define PIO_PD14C_SDCKE           (1u << 14) /**< \brief Ebi signal: SDCKE */
#define PIO_PD29C_SDWE            (1u << 29) /**< \brief Ebi signal: SDWE */
/* ========== Pio definition for GMAC peripheral ========== */
#define PIO_PD13A_GCOL            (1u << 13) /**< \brief Gmac signal: GCOL */
#define PIO_PD10A_GCRS            (1u << 10) /**< \brief Gmac signal: GCRS */
#define PIO_PD8A_GMDC             (1u << 8)  /**< \brief Gmac signal: GMDC */
#define PIO_PD9A_GMDIO            (1u << 9)  /**< \brief Gmac signal: GMDIO */
#define PIO_PD5A_GRX0             (1u << 5)  /**< \brief Gmac signal: GRX0 */
#define PIO_PD6A_GRX1             (1u << 6)  /**< \brief Gmac signal: GRX1 */
#define PIO_PD11A_GRX2            (1u << 11) /**< \brief Gmac signal: GRX2 */
#define PIO_PD12A_GRX3            (1u << 12) /**< \brief Gmac signal: GRX3 */
#define PIO_PD14A_GRXCK           (1u << 14) /**< \brief Gmac signal: GRXCK */
#define PIO_PD4A_GRXDV            (1u << 4)  /**< \brief Gmac signal: GRXDV */
#define PIO_PD7A_GRXER            (1u << 7)  /**< \brief Gmac signal: GRXER */
#define PIO_PB1B_GTSUCOMP         (1u << 1)  /**< \brief Gmac signal: GTSUCOMP */
#define PIO_PB12B_GTSUCOMP        (1u << 12) /**< \brief Gmac signal: GTSUCOMP */
#define PIO_PD11C_GTSUCOMP        (1u << 11) /**< \brief Gmac signal: GTSUCOMP */
#define PIO_PD20C_GTSUCOMP        (1u << 20) /**< \brief Gmac signal: GTSUCOMP */
#define PIO_PD2A_GTX0             (1u << 2)  /**< \brief Gmac signal: GTX0 */
#define PIO_PD3A_GTX1             (1u << 3)  /**< \brief Gmac signal: GTX1 */
#define PIO_PD15A_GTX2            (1u << 15) /**< \brief Gmac signal: GTX2 */
#define PIO_PD16A_GTX3            (1u << 16) /**< \brief Gmac signal: GTX3 */
#define PIO_PD0A_GTXCK            (1u << 0)  /**< \brief Gmac signal: GTXCK */
#define PIO_PD1A_GTXEN            (1u << 1)  /**< \brief Gmac signal: GTXEN */
#define PIO_PD17A_GTXER           (1u << 17) /**< \brief Gmac signal: GTXER */
/* ========== Pio definition for HSMCI peripheral ========== */
#define PIO_PA28C_MCCDA           (1u << 28) /**< \brief Hsmci signal: MCCDA */
#define PIO_PA25D_MCCK            (1u << 25) /**< \brief Hsmci signal: MCCK */
#define PIO_PA30C_MCDA0           (1u << 30) /**< \brief Hsmci signal: MCDA0 */
#define PIO_PA31C_MCDA1           (1u << 31) /**< \brief Hsmci signal: MCDA1 */
#define PIO_PA26C_MCDA2           (1u << 26) /**< \brief Hsmci signal: MCDA2 */
#define PIO_PA27C_MCDA3           (1u << 27) /**< \brief Hsmci signal: MCDA3 */
/* ========== Pio definition for ISI peripheral ========== */
#define PIO_PD22D_ISI_D0          (1u << 22) /**< \brief Isi signal: ISI_D0 */
#define PIO_PD21D_ISI_D1          (1u << 21) /**< \brief Isi signal: ISI_D1 */
#define PIO_PD30D_ISI_D10         (1u << 30) /**< \brief Isi signal: ISI_D10 */
#define PIO_PD31D_ISI_D11         (1u << 31) /**< \brief Isi signal: ISI_D11 */
#define PIO_PB3D_ISI_D2           (1u << 3)  /**< \brief Isi signal: ISI_D2 */
#define PIO_PA9B_ISI_D3           (1u << 9)  /**< \brief Isi signal: ISI_D3 */
#define PIO_PA5B_ISI_D4           (1u << 5)  /**< \brief Isi signal: ISI_D4 */
